Revit 2020 API
ModelPath.CentralServerPath Property
 A path to the location of the central Revit server.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2012
Syntax
C#
public string CentralServerPath { get; }
Visual Basic
Public ReadOnly Property CentralServerPath As String
	Get
Visual C++
public:
property String^ CentralServerPath {
	String^ get ();
}
See Also
ModelPath Class
Autodesk.Revit.DB Namespace